<?php
// +----------------------------------------------------------------------
// | 发送邮件设置
// +----------------------------------------------------------------------

return [
    //smtp服务器的名称
    'host'          => 'smtp.qq.com', 
    //发件人主机域名
    'host_name'     => 'www.xchtzon.top', 
    //启用smtp认证
    'smtp_auth'     =>  TRUE, 
    //SMTP服务器端口
    'port'          => '465', 
    //你的邮箱名
    'user_name'     => '1027854092@qq.com', 
    //发件人地址
    'from'          => '1027854092@qq.com', 
    //发件人姓名
    'from_name'     => '学创网络', 
    //邮箱密码切记是邮箱授权码
    'password'      => 'jymsvcmwcmrbbfcj', 
    //设置邮件编码
    'charset'       => 'utf-8', 
    // 是否HTML格式邮件
    'isHTML'        =>  TRUE, 


];
